Котельников_АБ_70153995/src/Documents/ПредложениеОРаботе/ПредложениеОРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредложениеОРаботе</name>
  <basedOn>Document.Вакансия</basedOn>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПредложенияОРаботе</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/КоличествоКандидатовПоЭтапам/КоличествоКандидатовПоЭтапам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоКандидатовПоЭтапам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/InformationRegisters/СтатусыКандидатов/СтатусыКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/СтатусыПредложенияОРаботе/СтатусыПредложенияОРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПредложенияОРаботе</name>
  <enumValues>
    <name>СделаноПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатПринялПредложение</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказался</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Enums/ЭтапыПодбора/ЭтапыПодбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПодбора</name>
  <enumValues>
    <name>Неразобранные</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрРезюме</name>
  </enumValues>
  <enumValues>
    <name>ТелефонноеИнтервью</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПринялПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказалсяОтПредложения</name>
  </enumValues>
  <enumValues>
    <name>ОтказКандидату</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ПредложениеОРаботе/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Вакансия") Тогда
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		ДоВычетаНалога = ДанныеЗаполнения.ДоВычетаНалога;
		Должность = ДанныеЗаполнения.Должность;
		ЗарплатаДо = ДанныеЗаполнения.ОплатаТрудаДо;
		ЗарплатаОт = ДанныеЗаполнения.ОплатаТрудаОт;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Вакансия = ДанныеЗаполнения.Ссылка;
		ТипЗанятости = ДанныеЗаполнения.ТипЗанятости;
		ФорматРаботы = ДанныеЗаполнения.ФорматРаботы;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписатьДвиженияКоличествоКандидатовПоЭтапам();
	ЗаписатьДвиженияСтатусыКандидатов();

КонецПроцедуры

Процедура ЗаписатьДвиженияКоличествоКандидатовПоЭтапам()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	
	Если Статус = Перечисления.СтатусыПредложенияОРаботе.СделаноПредложениеОРаботе Тогда
		Движение.Этап = Перечисления.ЭтапыПодбора.ПредложениеОРаботе;
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли Статус = Перечисления.СтатусыПредложенияОРаботе.КандидатПринялПредложение Тогда
		Движение.Этап = Перечисления.ЭтапыПодбора.ПринялПредложениеОРаботе;
		Движение.ЭтапПройден = Истина;
	ИначеЕсли Статус = Перечисления.СтатусыПредложенияОРаботе.КандидатОтказался Тогда 
		Движение.Этап = Перечисления.ЭтапыПодбора.КандидатОтказалсяОтПредложения;
		Движение.ЭтапПройден = Ложь;
	КонецЕсли;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.Тестирование;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;	

КонецПроцедуры

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Движение = Движения.СтатусыКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Если Статус = Перечисления.СтатусыПредложенияОРаботе.СделаноПредложениеОРаботе Тогда
		Движение.Статус = Перечисления.ЭтапыПодбора.ПредложениеОРаботе;
		Движение.ЭтапПройден = Ложь;
	ИначеЕсли Статус = Перечисления.СтатусыПредложенияОРаботе.КандидатПринялПредложение Тогда
		Движение.Статус = Перечисления.ЭтапыПодбора.ПринялПредложениеОРаботе;
		Движение.ЭтапПройден = Истина;
	ИначеЕсли Статус = Перечисления.СтатусыПредложенияОРаботе.КандидатОтказался Тогда 
		Движение.Статус = Перечисления.ЭтапыПодбора.КандидатОтказалсяОтПредложения;
		Движение.ЭтапПройден = Ложь;
	КонецЕсли;

КонецПроцедуры
